JayHeng/RT-MFB/boards/mimxrt/mfb_fw/src/mfb.c
    return true;
}

static bool mfb_flash_verify_pattern_region(void)
{
    for (uint32_t idx = 0; idx < MFB_FLASH_ACCESS_REGION_SIZE / FLASH_PAGE_SIZE; idx++)
    {
        if (!mfb_flash_handle_one_pattern_page(MFB_FLASH_ACCESS_REGION_START + idx * FLASH_PAGE_SIZE, false))
        {
            return false;
        }
    }
    
    return true;
}
#endif

bool mfb_flash_pattern_verify_test(bool fillPatternWhenFailure, bool isOctalDdrMode)
{
    bool result = true;

    // For QuadSPI Flash
    //  1. It is 1st time verify (before QE enablment), do nothing when failure
    //  2. It is 2nd time verify (after QE enablment), write pattern when failure then verify (ERASE/PROGRAM seq in vendor LUT)
    // For OctalSPI Flash
    //  1. It is 1st time verify (before Reading ID), do nothing when failure
    //  2. It is 2nd time verify (before OPI enablment), write pattern when failure then verify (ERASE/PROGRAM seq in common LUT)
    //  3. It is 3rd time verify (after OPI enablment), just verify even failure
#if MFB_FLASH_PATTERN_VERIFY_ENABLE
    result = mfb_flash_verify_pattern_region();
    if ((!result) && fillPatternWhenFailure)
    {
        mfb_printf("MFB: Write pattern data into Flash region 0x%x - 0x%x.\r\n", MFB_FLASH_ACCESS_REGION_START, MFB_FLASH_ACCESS_REGION_START + MFB_FLASH_ACCESS_REGION_SIZE - 1);
        uint32_t sectorMax = MFB_FLASH_ACCESS_REGION_SIZE / SECTOR_SIZE;
        uint32_t pagesPerSector = SECTOR_SIZE / FLASH_PAGE_SIZE;
        for (uint32_t sectorId = 0; sectorId < sectorMax; sectorId++)
        {
            uint32_t sectorAddr = MFB_FLASH_ACCESS_REGION_START + sectorId * SECTOR_SIZE;
            status_t status = flexspi_nor_flash_erase_sector(EXAMPLE_FLEXSPI, sectorAddr, isOctalDdrMode);
            if (status != kStatus_Success)
            {
                mfb_printf("MFB: Erase flash sector failure at address 0x%x!\r\n", sectorAddr);
                return false;
            }
            for (uint32_t pageId = 0; pageId < pagesPerSector; pageId++)
            {
                uint32_t pageAddr = sectorAddr + pageId * FLASH_PAGE_SIZE;
                mfb_flash_handle_one_pattern_page(pageAddr, true);
                status = flexspi_nor_flash_page_program(EXAMPLE_FLEXSPI, pageAddr, (const uint32_t *)s_nor_rw_buffer, FLASH_PAGE_SIZE, isOctalDdrMode);
                if (status != kStatus_Success)
                {
                    mfb_printf("MFB: Program flash page failure at address 0x%x!\r\n", pageAddr);
                    return false;
                }
            }
        }
#if defined(CACHE_MAINTAIN) && CACHE_MAINTAIN
        DCACHE_InvalidateByRange(EXAMPLE_FLEXSPI_AMBA_BASE + MFB_FLASH_ACCESS_REGION_START, MFB_FLASH_ACCESS_REGION_SIZE);
#endif
        result = mfb_flash_verify_pattern_region();
    }

    if (result)
    {
        mfb_printf("MFB: Flash Pattern data readback verification - Passed.\r\n");
    }
    else
    {
        if (!fillPatternWhenFailure)
        {
            mfb_printf("MFB: Flash Pattern data has not been written.\r\n");
        }
        else
        {
            mfb_printf("MFB: Flash Pattern data readback verification - Failed.\r\n");
        }
    }
#endif
    
    return result;
}

void mfb_flash_memcpy_perf_test(bool isFirstTime)
{
#if MFB_FLASH_MEMCPY_PERF_ENABLE
    if (isFirstTime)
    {
        microseconds_init();
    }

    uint64_t startTicks = microseconds_get_ticks();
    uint64_t totalSize = (8UL*1024*1024);
    uint32_t loopMax = totalSize / MFB_FLASH_ACCESS_REGION_SIZE;
    uint32_t unitSize = FLASH_PAGE_SIZE;
    uint32_t idxMax = MFB_FLASH_ACCESS_REGION_SIZE / unitSize;
    /* Read 8MB data from flash to test speed */
    for (uint32_t loop = 0; loop < loopMax; loop++)
    {
        /* Min NOR Flash size is 64KB */
        for (uint32_t idx = 0; idx < idxMax; idx++)
        {
            memcpy(s_nor_rw_buffer, (uint8_t*)(EXAMPLE_FLEXSPI_AMBA_BASE + MFB_FLASH_ACCESS_REGION_START + idx * unitSize), unitSize);
        }
    }
    uint64_t totalTicks = microseconds_get_ticks() - startTicks;
    uint32_t microSecs = microseconds_convert_to_microseconds(totalTicks);
    uint32_t kBps = (totalSize / 1024) * 1000000 / microSecs;
    mfb_printf("MFB: Flash to RAM memcpy speed: %dKB/s.\r\n", kBps);

    if (!isFirstTime)
    {
        microseconds_shutdown();
    }
#endif
}

void mfb_jump_to_application(uint32_t vectorStartAddr)
{
#if MFB_APP_JUMP_ENABLE
    mfb_printf("\r\nMFB: Jump to Application code at 0x%x.\r\n", EXAMPLE_FLEXSPI_AMBA_BASE + MFB_APP_IMAGE_OFFSET);
    mfb_printf("-------------------------------------\r\n");
    static uint32_t s_resetEntry = 0;
    static uint32_t s_stackPointer = 0;
    s_resetEntry = *(uint32_t *)(vectorStartAddr + 4);
    s_stackPointer = *(uint32_t *)vectorStartAddr;
    // Turn off interrupts.
    __disable_irq();

    // Set the VTOR.
    SCB->VTOR = vectorStartAddr;

    // Memory barriers for good measure.
    __ISB();
    __DSB();

    // Set main stack pointer and process stack pointer.
    __set_MSP(s_stackPointer);
    __set_PSP(s_stackPointer);

    // Jump to application entry point, does not return.
    static void (*s_entry)(void) = 0;
    s_entry = (void (*)(void))s_resetEntry;
    s_entry();
#endif
}

uint32_t mfb_decode_common_capacity_id(uint8_t capacityID)
{
    uint32_t memSizeInBytes = 0;
    //| ISSI QuadSPI       |  MXIC OctalSPI     |  Micron QuadSPI    |
    //| ISSI OctalSPI      |  MXIC QuadSPI U    |GigaDevice QuadSPI Q|
    //| MXIC QuadSPI R/L/V |                    |                    |
    //| Winbond QuadSPI    |                    |                    |
    //| Micron OctalSPI    |                    |                    |
    //| GigaDevice QuadSPI |                    |                    |
    //| GigaDevice OctalSPI|                    |                    |
    //|Adesto QuadSPI SL/QL|                    |                    |
    //|---------------------------------------------------------------
    //| 09h - 256Kb        |                    |                    |
    //| 10h - 512Kb        |                    |                    |
    //| 11h - 1Mb          |                    |                    |
    //| 12h - 2Mb          |                    |                    |
    //| 13h - 4Mb          |                    |                    |
    //| 14h - 8Mb          |                    |                    |
    //| 15h - 16Mb         |                    |                    |
    //| 16h - 32Mb         |                    |                    |
    //| 17h - 64Mb         |  37h - 64Mb        |   17h - 64Mb       |
    //| 18h - 128Mb        |  38h - 128Mb       |   18h - 128Mb      |
    //| 19h - 256Mb        |  39h - 256Mb       |   19h - 256Mb      |
    //| 1ah - 512Mb        |  3ah - 512Mb       |   20h - 512Mb      |
    //| 1bh - 1Gb          |  3bh - 1Gb         |   21h - 1Gb        |
    //| 1ch - 2Gb          |  3ch - 2Gb         |   22h - 2Gb        |
    if (capacityID <= 0x09)
    {
        capacityID += 6;
    }
    else if (capacityID <= 0x1c)
    {
        // Do Nothing
    }
    else if (capacityID <= 0x22)
    {
        capacityID -= 6;
    }
    else
    {
        capacityID &= 0x1F;
    }
    memSizeInBytes = 1 << capacityID;
    return memSizeInBytes;
}

