JayHeng/RT-MFB/boards/mimxrt/mfb_fw/src/mfb.c
uint32_t mfb_decode_adesto_capacity_id(uint8_t capacityID)
{
    uint32_t memSizeInBytes = 0;
    //|Adesto QuadSPI      | Adesto QuadSPI EU  |
    //|------------------------------------------
    //|                    | 10h - 1Mb          |
    //| 03h - 2Mb          | 11h - 2Mb          |
    //| 04h - 4Mb          | 14h - 4Mb          |
    //| 05h - 8Mb          |                    |
    //| 06h - 16Mb         |                    |
    //| 07h - 32Mb         |                    |
    //| 08h - 64Mb         |                    |
    //| 09h - 128Mb        |                    |
    if (capacityID <= 0x09)
    {
        capacityID += 15;
    }
    else if (capacityID == 0x10)
    {
        capacityID = 0x11;
    }
    else if (capacityID == 0x11)
    {
        capacityID = 0x12;
    }
    else if (capacityID == 0x14)
    {
        capacityID = 0x13;
    }
    memSizeInBytes = 1 << capacityID;
    return memSizeInBytes;
}

void mfb_show_mem_size(uint8_t capacityID, bool isAdesto)
{
#if MFB_DEBUG_LOG_INFO_ENABLE
    uint32_t flashMemSizeInKB;
    if (isAdesto)
    {
        mfb_printf("MFB: Flash Density Code: 0x%x", capacityID);
        flashMemSizeInKB = mfb_decode_adesto_capacity_id(capacityID)/ 0x400;
    }
    else
    {
        mfb_printf("MFB: Flash Capacity ID: 0x%x", capacityID);
        flashMemSizeInKB = mfb_decode_common_capacity_id(capacityID)/ 0x400;
    }
    if (flashMemSizeInKB <= 0x400)
    {
        mfb_printf(" -- %dKB.\r\n", flashMemSizeInKB);
    }
    else
    {
        mfb_printf(" -- %dMB.\r\n", flashMemSizeInKB / 0x400);
    }
#endif
}

void mfb_main(void)
{
    status_t status = kStatus_Success;
    jedec_id_t jedecID;

    mfb_printf("MFB: i.MXRT multi-flash boot solution.\r\n");
    /* Show CPU clock source */
    cpu_show_clock_source();
    /* Init FlexSPI pinmux */
    flexspi_port_switch(EXAMPLE_FLEXSPI, FLASH_PORT, kFLEXSPI_1PAD);
    flexspi_pin_init(EXAMPLE_FLEXSPI,    FLASH_PORT, kFLEXSPI_1PAD);
    /* Move FlexSPI clock to a stable clock source */ 
    flexspi_clock_init(EXAMPLE_FLEXSPI, kFlexspiRootClkFreq_30MHz);
    /* Init FlexSPI using common LUT */ 
    flexspi_nor_flash_init(EXAMPLE_FLEXSPI, s_customLUTCommonMode, kFLEXSPI_ReadSampleClkLoopbackInternally);
    mfb_printf("\r\nMFB: FLEXSPI module is initialized to 1bit SDR normal read mode.\r\n");
    /* Show FlexSPI clock source */
    flexspi_show_clock_source(EXAMPLE_FLEXSPI);

    /* Get JEDEC ID. */
#if MFB_FLASH_FAKE_JEDEC_ID_ENABLE
    jedecID.manufacturerID = MICRON_OCTAL_FLASH_JEDEC_ID & 0xFF;
    jedecID.memoryTypeID = (MICRON_OCTAL_FLASH_JEDEC_ID >> 8) & 0xFF;
    jedecID.capacityID = (MICRON_OCTAL_FLASH_JEDEC_ID >> 16) & 0xFF;
#else
    status = flexspi_nor_get_jedec_id(EXAMPLE_FLEXSPI, (uint32_t *)&jedecID);
    if (status != kStatus_Success)
    {
        mfb_printf("MFB: Get Flash Vendor ID failed.\r\n");
    }
    else
#endif
    {
        bool sta_isOctalFlash = false;
        bool sta_isOctalDdrMode = false;
        bool sta_isValidVendorId = true;
        flexspi_pad_t cfg_pad = kFLEXSPI_4PAD;
        flexspi_root_clk_freq_t cfg_rootClkFreq = kFlexspiRootClkFreq_100MHz;
        flexspi_read_sample_clock_t cfg_readSampleClock = kFLEXSPI_ReadSampleClkLoopbackFromDqsPad;
        const uint32_t *cfg_customLUTVendor;
        uint32_t cfg_dummyValue = DUMMY_VALUE_INVALID;
        /* Get real flash size according to jedec id result (it may not be appliable to some specifal adesto device) */
        uint32_t cfg_flashMemSizeInByte = mfb_decode_common_capacity_id(jedecID.capacityID);
        /* Do patten verify test under 1bit SPI mode */
        mfb_flash_pattern_verify_test(false, sta_isOctalDdrMode);
        /* Get perf test result under 1bit SPI mode */
        mfb_flash_memcpy_perf_test(true);
        mfb_printf("MFB: Flash Manufacturer ID: 0x%x", jedecID.manufacturerID);
        /* Check Vendor ID. */
        switch (jedecID.manufacturerID)
        {
#if MXIC_DEVICE_SERIES
            // MXIC
            case MXIC_DEVICE_VENDOR_ID:
                {
                    mfb_printf(" -- MXIC Serial Flash.\r\n");
                    mfb_printf("MFB: Flash Memory Type ID: 0x%x", jedecID.memoryTypeID);
                    switch (jedecID.memoryTypeID)
                    {
                        case 0x20:
                            mfb_printf(" -- MX25L/MX66L/MX25V QuadSPI 3.3V Series.\r\n");
                            break;
                        case 0x25:
                            mfb_printf(" -- MX25U/MX66U QuadSPI 1.8V Series.\r\n");
                            break;
                        case 0x28:
                            mfb_printf(" -- MX25R QuadSPI 1.8-3.3V Series.\r\n");
                            break;
                        case 0x75:
                            mfb_printf(" -- MX77L QuadSPI 3.3V Series.\r\n");
                            break;
                        case 0x80:
                            sta_isOctalFlash = true;
                            mfb_printf(" -- MX25UM/MX66UM OctalSPI 1.8V Series.\r\n");
                            break;
                        case 0x81:
                            sta_isOctalFlash = true;
                            mfb_printf(" -- MX25UM51345G OctalSPI 1.8V Series.\r\n");
                            break;
                        case 0x83:
                            sta_isOctalFlash = true;
                            mfb_printf(" -- MX25UM25345G OctalSPI 1.8V Series.\r\n");
                            break;
                        case 0x84:
                            sta_isOctalFlash = true;
                            mfb_printf(" -- MX25UW51345G OctalSPI 1.8V Series.\r\n");
                            break;
                        case 0x85:
                            sta_isOctalFlash = true;
                            mfb_printf(" -- MX25LM/MX66LM OctalSPI 3.3V Series.\r\n");
                            break;
                        // Missing MX25LW51245G, MX66LW1G45G, MX66LW2G45G
                        // Missing MX25UW6445G, MX66UW12845G, MX25UW25645G, MX25UW51245G, MX66UW1G45G, MX66UW2G45G
                        // Missing MX25UW6345G, MX66LW12345G, MX66UW25345G      done                 , MX66UW2G345G
                        default:
                            mfb_printf(" -- Unsupported Series.\r\n");
                            break;
                    }
                    mfb_show_mem_size(jedecID.capacityID, false);
#if MXIC_DEVICE_OCTAL
                    if (sta_isOctalFlash)
                    {
                        cfg_pad                 = kFLEXSPI_8PAD;
                        cfg_rootClkFreq         = kFlexspiRootClkFreq_166MHz;
                        cfg_readSampleClock     = kFLEXSPI_ReadSampleClkExternalInputFromDqsPad;
                        s_flashBusyStatusPol    = MXIC_FLASH_BUSY_STATUS_POL;
                        s_flashBusyStatusOffset = MXIC_FLASH_BUSY_STATUS_OFFSET;
                        s_flashEnableOctalCmd   = MXIC_OCTAL_FLASH_ENABLE_DDR_CMD;
                        cfg_customLUTVendor     = s_customLUT_MXIC_Octal;
                        if (cfg_rootClkFreq == kFlexspiRootClkFreq_200MHz)
                        {
                            cfg_dummyValue = MXIC_OCTAL_FLASH_SET_DUMMY_CMD;
                        }
                    }
#endif
                    break;
                }
#endif // MXIC_DEVICE_SERIES

