JayHeng/RT-MFB/boards/mimxrt/mfb_fw/src/mfb.c
#if ISSI_DEVICE_SERIES
            // ISSI
            case ISSI_DEVICE_VENDOR_ID:
                {
                    mfb_printf(" -- ISSI Serial Flash.\r\n");
                    mfb_printf("MFB: Flash Memory Type ID: 0x%x", jedecID.memoryTypeID);
                    switch (jedecID.memoryTypeID)
                    {
                        case 0x40:
                            mfb_printf(" -- IS25LQ/IS25LP QuadSPI 3.3V Series.\r\n");
                            break;
                        case 0x60:
                            mfb_printf(" -- IS25LP/IS25LE QuadSPI 3.3V Series.\r\n");
                            break;
                        case 0x70:
                            mfb_printf(" -- IS25WP/IS25WJ/IS25WE QuadSPI 1.8V Series.\r\n");
                            break;
                        case 0x5A:
                            sta_isOctalFlash = true;
                            mfb_printf(" -- IS25LX OctalSPI 3.3V Series.\r\n");
                            break;
                        case 0x5B:
                            sta_isOctalFlash = true;
                            mfb_printf(" -- IS25WX OctalSPI 1.8V Series.\r\n");
                            break;
                        default:
                            mfb_printf(" -- Unsupported Series.\r\n");
                            break;
                    }
                    mfb_show_mem_size(jedecID.capacityID, false);
#if ISSI_DEVICE_QUAD
                    if (!sta_isOctalFlash)
                    {
                        cfg_pad                 = kFLEXSPI_4PAD;
                        cfg_rootClkFreq         = kFlexspiRootClkFreq_100MHz;
                        cfg_readSampleClock     = kFLEXSPI_ReadSampleClkLoopbackFromDqsPad;
                        s_flashBusyStatusPol    = ISSI_FLASH_BUSY_STATUS_POL;
                        s_flashBusyStatusOffset = ISSI_FLASH_BUSY_STATUS_OFFSET;
                        s_flashQuadEnableCfg    = ISSI_FLASH_QUAD_ENABLE;
                        cfg_customLUTVendor     = s_customLUT_ISSI_Quad;
                    }
#endif
#if ISSI_DEVICE_OCTAL
                    if (sta_isOctalFlash)
                    {
                        cfg_pad                 = kFLEXSPI_8PAD;
                        s_flashBusyStatusPol    = ISSI_FLASH_BUSY_STATUS_POL;
                        s_flashBusyStatusOffset = ISSI_FLASH_BUSY_STATUS_OFFSET;
                        s_flashEnableOctalCmd   = ISSI_OCTAL_FLASH_ENABLE_DDR_CMD;
                        cfg_customLUTVendor     = s_customLUT_ISSI_Octal;
#if MFB_FLASH_FORCE_LOOPBACK_DQS
                        cfg_rootClkFreq         = kFlexspiRootClkFreq_30MHz;
                        cfg_readSampleClock     = kFLEXSPI_ReadSampleClkLoopbackFromDqsPad;
#else
                        cfg_rootClkFreq         = kFlexspiRootClkFreq_166MHz;
                        cfg_readSampleClock     = kFLEXSPI_ReadSampleClkExternalInputFromDqsPad;
                        if (cfg_rootClkFreq == kFlexspiRootClkFreq_200MHz)
#endif
                        {
                            cfg_dummyValue = ISSI_OCTAL_FLASH_SET_DUMMY_CMD;
                        }
                    }
#endif
                    break;
                }
#endif // ISSI_DEVICE_SERIES

#if WINBOND_DEVICE_SERIES
            // Winbond
            case WINBOND_DEVICE_VENDOR_ID:
                {
                    mfb_printf(" -- Winbond Serial Flash.\r\n");
                    mfb_printf("MFB: Flash Memory Type ID: 0x%x", jedecID.memoryTypeID);
                    switch (jedecID.memoryTypeID)
                    {
                        case 0x30:
                            mfb_printf(" -- W25X DualSPI 3.3V Series.\r\n");
                            break;
                        case 0x40:
                            mfb_printf(" -- W25QxxxDV/FV/BV/CL/JV(-IQ/JQ) QuadlSPI 3.3V Series.\r\n");
                            break;
                        case 0x60:
                            mfb_printf(" -- W25QxxxFW/EW/NW(-IQ/IN) QuadlSPI 1.8V Series.\r\n");
                            break;
                        case 0x70:
                            mfb_printf(" -- W25QxxxJV(-IM/JM) QuadlSPI 3.3V Series.\r\n");
                            break;
                        case 0x80:
                            mfb_printf(" -- W25QxxxJW/NW(-IM) QuadlSPI 1.8V Series.\r\n");
                            break;
                        // Missing W25H, W25M, W25R
                        // Missing xxxJL, xxxDW, xxxRV
                        default:
                            mfb_printf(" -- Unsupported Series.\r\n");
                            break;
                    }
                    mfb_show_mem_size(jedecID.capacityID, false);
#if WINBOND_DEVICE_QUAD
                    if (!sta_isOctalFlash)
                    {
                        cfg_pad                 = kFLEXSPI_4PAD;
                        cfg_rootClkFreq         = kFlexspiRootClkFreq_133MHz;
                        cfg_readSampleClock     = kFLEXSPI_ReadSampleClkLoopbackFromDqsPad;
                        s_flashBusyStatusPol    = WINBOND_FLASH_BUSY_STATUS_POL;
                        s_flashBusyStatusOffset = WINBOND_FLASH_BUSY_STATUS_OFFSET;
                        s_flashQuadEnableCfg    = WINBOND_FLASH_QUAD_ENABLE;
                        cfg_customLUTVendor     = s_customLUT_WINBOND_Quad;
                    }
#endif
                    break;
                }
#endif // WINBOND_DEVICE_SERIES

#if MICRON_DEVICE_SERIES
            // Micron
            case MICRON_DEVICE_VENDOR_ID:
                {
                    mfb_printf(" -- Micron Serial Flash.\r\n");
                    mfb_printf("MFB: Flash Memory Type ID: 0x%x", jedecID.memoryTypeID);
                    switch (jedecID.memoryTypeID)
                    {
                        case 0xBA:
                            mfb_printf(" -- MT25QL QuadSPI 3.3V Series.\r\n");
                            break;
                        case 0xBB:
                            mfb_printf(" -- MT25QU QuadSPI 1.8V Series.\r\n");
                            break;
                        case 0x5A:
                            sta_isOctalFlash = true;
                            mfb_printf(" -- MT35XL OctalSPI 3.3V Series.\r\n");
                            break;
                        case 0x5B:
                            sta_isOctalFlash = true;
                            mfb_printf(" -- MT35XU OctalSPI 1.8V Series.\r\n");
                            break;
                        default:
                            mfb_printf(" -- Unsupported Series.\r\n");
                            break;
                    }
                    mfb_show_mem_size(jedecID.capacityID, false);
#if MICRON_DEVICE_QUAD
                    if (!sta_isOctalFlash)
                    {
                        cfg_pad                 = kFLEXSPI_4PAD;
                        cfg_rootClkFreq         = kFlexspiRootClkFreq_100MHz;
                        cfg_readSampleClock     = kFLEXSPI_ReadSampleClkLoopbackFromDqsPad;
                        s_flashBusyStatusPol    = MICRON_FLASH_BUSY_STATUS_POL;
                        s_flashBusyStatusOffset = MICRON_FLASH_BUSY_STATUS_OFFSET;
                        //s_flashQuadEnableCfg    = MICRON_FLASH_QUAD_ENABLE;
                        cfg_customLUTVendor     = s_customLUT_MICRON_Quad;
                        /* No need to enable quad mode for micron device. */
                    }
#endif
#if MICRON_DEVICE_OCTAL
                    if (sta_isOctalFlash)
                    {
                        cfg_pad                 = kFLEXSPI_8PAD;
                        s_flashBusyStatusPol    = MICRON_FLASH_BUSY_STATUS_POL;
                        s_flashBusyStatusOffset = MICRON_FLASH_BUSY_STATUS_OFFSET;
                        s_flashEnableOctalCmd   = MICRON_OCTAL_FLASH_ENABLE_DDR_CMD;
                        cfg_customLUTVendor     = s_customLUT_MICRON_Octal;
#if MFB_FLASH_FORCE_LOOPBACK_DQS
                        cfg_rootClkFreq         = kFlexspiRootClkFreq_30MHz;
                        cfg_readSampleClock     = kFLEXSPI_ReadSampleClkLoopbackFromDqsPad;
#else
                        cfg_rootClkFreq         = kFlexspiRootClkFreq_166MHz;
                        cfg_readSampleClock     = kFLEXSPI_ReadSampleClkExternalInputFromDqsPad;
                        if (cfg_rootClkFreq == kFlexspiRootClkFreq_200MHz)
#endif
                        {
                            cfg_dummyValue = MICRON_OCTAL_FLASH_SET_DUMMY_CMD;
                        }
                    }
#endif
                    break;
                }
#endif // MICRON_DEVICE_SERIES

